RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal_xspi.c
        /* Configure the CCR register with all communication parameters */
        MODIFY_REG((*ccr_reg), (XSPI_CCR_ADMODE | XSPI_CCR_ADDTR | XSPI_CCR_ADSIZE),
                   (pCmd->AddressMode | pCmd->AddressDTRMode | pCmd->AddressWidth));
      }

      /* Configure the AR register with the instruction value */
      hxspi->Instance->AR = pCmd->Address;
    }
    else
    {
      /* ---- Invalid command configuration (no instruction, no address) ---- */
      status = HAL_ERROR;
      hxspi->ErrorCode = HAL_XSPI_ERROR_INVALID_PARAM;
    }
  }

  return status;
}

/**
  * @brief  Get the current IOM configuration for an XSPI instance.
  * @param  instance_nb : number of the instance
  * @param  pCfg         : configuration of the IO Manager for the instance
  * @retval HAL status
  */
static void XSPIM_GetConfig(uint8_t instance_nb, XSPIM_CfgTypeDef *const pCfg)
{
  uint32_t mux;
  uint32_t mode;

  if (instance_nb == 1U)
  {
    if ((XSPIM->CR & XSPIM_CR_MODE) == 0U)
    {
      pCfg->IOPort = HAL_XSPIM_IOPORT_1;
    }
    else
    {
      pCfg->IOPort = HAL_XSPIM_IOPORT_2;
    }

    if ((XSPIM->CR & XSPIM_CR_CSSEL_OVR_EN) != XSPIM_CR_CSSEL_OVR_EN)
    {
      pCfg->nCSOverride = HAL_XSPI_CSSEL_OVR_DISABLED;
    }
    else if ((XSPIM->CR & XSPIM_CR_CSSEL_OVR_O1) == XSPIM_CR_CSSEL_OVR_O1)
    {
      pCfg->nCSOverride = HAL_XSPI_CSSEL_OVR_NCS2;
    }
    else
    {
      pCfg->nCSOverride = HAL_XSPI_CSSEL_OVR_NCS1;
    }
  }
  else
  {
    mux = (XSPIM->CR & XSPIM_CR_MUXEN);
    mode = ((XSPIM->CR & XSPIM_CR_MODE) >> XSPIM_CR_MODE_Pos);
    if (mux != mode)
    {
      pCfg->IOPort = HAL_XSPIM_IOPORT_1;
    }
    else
    {
      pCfg->IOPort = HAL_XSPIM_IOPORT_2;
    }
    if ((XSPIM->CR & XSPIM_CR_CSSEL_OVR_EN) != XSPIM_CR_CSSEL_OVR_EN)
    {
      pCfg->nCSOverride = HAL_XSPI_CSSEL_OVR_DISABLED;
    }
    else if ((XSPIM->CR & XSPIM_CR_CSSEL_OVR_O2) == XSPIM_CR_CSSEL_OVR_O2)
    {
      pCfg->nCSOverride = HAL_XSPI_CSSEL_OVR_NCS2;
    }
    else
    {
      pCfg->nCSOverride = HAL_XSPI_CSSEL_OVR_NCS1;
    }
  }
}
/**
  @endcond
  */

/**
  * @}
  */

#endif /* HAL_XSPI_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */

#endif /* XSPI || XSPI1 || XSPI2 */
